import numpy as np
from PyQt6.QtGui import QColor


def calculate_light_intensity(vertex, tri, light_dir):
    """Вычисляет интенсивность света для треугольника"""
    p1, p2, p3 = np.array(vertex[tri[0]]), np.array(vertex[tri[1]]), np.array(vertex[tri[2]])

    # Векторное произведение для нахождения нормали
    normal = np.cross(p2 - p1, p3 - p1)
    norm = np.linalg.norm(normal)
    if norm == 0:  # Обработка вырожденного треугольника
        return [1.0, 1.0, 1.0]
    normal = normal / norm  # Нормализация
    # Вычисление освещённости по углу между нормалью и направлением света
    intensity = np.dot(normal, light_dir)
    # Ограничиваем интенсивность от 0.2 до 1.0
    intensity = np.clip(intensity, 0.2, 1.0)
    return intensity

blue_shades = [
    QColor(0, 0, 255 - i * 20) for i in range(10)
]

alpha = 180
green_colors = [
    QColor(0, 255, 0, alpha),
    QColor(0, 128, 0, alpha),
    QColor(0, 180, 0, alpha),
    QColor(34, 139, 34, alpha),
    QColor(124, 252, 0, alpha),
    QColor(173, 255, 47, alpha),
    QColor(127, 255, 212, alpha)
]


connections = [[1, 5], [0, 1], [1, 2], [2, 3], [3, 4], [0, 5], [5, 6], [6, 7], [7, 8],
               [9, 10], [10, 11], [11, 12], [13, 14], [14, 15], [15, 16], [13, 17],
               [17, 18], [18, 19], [19, 20], [0, 17], [5, 9], [9, 13]]

fingers = [[0, 1, 2, 3, 4], [0, 5, 6, 7, 8], [0, 9, 10, 11, 12], [0, 13, 14, 15, 16], [0, 17, 18, 19, 20]]

thumb_edges = np.array([[21, 22], [22, 23], [23, 24], [24, 21],
                       [24, 26], [26, 25], [25, 23], [25, 27],
                       [28, 26], [22, 24], [23, 26], [25, 28],
                       [28, 69], [69, 71], [71, 70], [70, 27]])

pointer_edges = np.array([[29, 30], [30, 31], [31, 32], [32, 29],
                         [32, 34], [34, 33], [33, 31], [33, 35],
                         [36, 34], [30, 32], [31, 34], [33, 36],
                         [36, 72], [72, 74], [74, 73], [73, 35]])

middle_edges = np.array([[37, 38], [38, 39], [39, 40], [40, 37], [40, 42], [42, 41],
                        [41, 39], [41, 43], [44, 42], [38, 40], [39, 42], [41, 44],
                        [44, 75], [75, 77], [77, 76], [76, 43]])

ring_edges = np.array([[45, 46], [46, 47], [47, 48], [48, 45],
                      [48, 50], [50, 49], [49, 47], [49, 51],
                      [52, 50], [46, 48], [47, 50], [49, 52],
                      [52, 78], [78, 80], [80, 79], [79, 51]])

little_edges = np.array([[53, 54], [54, 55], [55, 56], [56, 53],
                        [56, 58], [58, 57], [57, 55], [57, 59],
                        [60, 58], [54, 56], [55, 58], [57, 60],
                        [60, 81], [81, 83], [83, 82], [82, 59]])

palm_edges = np.array(
    [[0, 21], [21, 22], [22, 29], [29, 30], [30, 37], [37, 38], [38, 45], [45, 46], [46, 53], [53, 54], [54, 0],
     [23, 29]])

inter_palm = np.array([[61, 62],[62, 63],[63, 66], [65, 66], [61, 65], [65, 66], [62, 65], [61, 65],
       [61, 64], [64, 65],[64, 67],[65, 67],[65, 68],[66, 68],
                      [21, 61], [22, 62], [29, 62], [30, 62],
                      [37, 63], [38, 63], [45, 66], [46, 66],
                      [53, 68], [0,64], [21, 64]])

edges = [thumb_edges, pointer_edges, middle_edges, ring_edges, little_edges, palm_edges, inter_palm]


thumb_poly = [(23, 24, 26), (22, 23, 24), (23, 25, 26), (25, 26, 28), (21, 22, 24), (28, 69, 71, 70, 27, 25)]
pointer_poly = [(29, 30, 32), (31, 32, 34), (33, 34, 36), (31, 33, 34), (30, 31, 32), (36, 72, 74, 73, 35, 33)]
middle_poly = [(38, 39, 40), (39, 41, 42), (39, 40, 42), (37, 38, 40), (41, 42, 44), (44, 75, 77, 76, 43, 41)]
ring_poly = [(46, 47, 48), (47, 48, 50), (47, 49, 50), (49, 50, 52), (45, 46, 48), (52, 78, 80, 79, 51, 49)]
little_poly = [(54, 55, 56), (57, 58, 60), (53, 54, 56), (55, 56, 58), (55, 57, 58), (60, 81, 83, 82, 59, 57)]
palm_poly = [(0, 21, 64), (45, 46, 66), (61, 62, 65), (37, 38, 63), (61, 64, 65),(64, 65, 67), (65, 66, 68), (22, 29, 62), (29, 30, 62),
             (0, 67, 65), (67, 68, 65), (68, 54, 53),(53, 46, 66, 68),(30, 37, 63, 62), (62, 63, 65), (65, 63, 38, 45), (21, 61, 64), (23, 29, 61)]

polygons = [thumb_poly, pointer_poly, middle_poly, ring_poly, little_poly, palm_poly]


